app/views/users/show.html.erb

<% else %>
  (You are logged in as <%= User.find(session[:user_id]).name %>.)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]