app/controllers/cars_controller.rb

  def tag_search
    if params[:tag]
      @cars = Car.tagged_with(params[:tag])
    else
      @cars = Car.all
---
SELECT "cars".* FROM "cars" INNER JOIN "taggings" ON "cars"."id" = "taggings"."car_id" WHERE "taggings"."tag_id" = ?  [["tag_id", 1]]
SELECT "tags".* FROM "tags" INNER JOIN "taggings" ON "tags"."id" = "taggings"."tag_id" WHERE "taggings"."car_id" = ?  [["car_id", 1]]

  def create
    @car = Car.new(car_params)

    respond_to do |format|
      if @car.save
---
INSERT INTO "cars" ("user_id", "plate_num", "model", "color", "year", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["user_id", 1], ["plate_num", "KA16"], ["model", "Audi"], ["color", "white"], ["year", 1992], ["created_at", "2017-10-21 22:44:23.997805"], ["updated_at", "2017-10-21 22:44:23.997805"]]