app/controllers/rental_posts_controller.rb

SELECT "rental_posts".* FROM "rental_posts"
---
  def index
    @rental_posts = RentalPost.all

SELECT  "rental_posts".* FROM "rental_posts" WHERE "rental_posts"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
---
    def set_rental_post
      @rental_post = RentalPost.find(params[:id])