app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
---
  def set_progress
    set_user
    expired_rentals = Rental.where([
      'user_id = ? AND status = ? AND start_time < ? AND renter_id = ?',
      @user.id, 0, DateTime.current, nil])
    expired_rentals.each do |rental|
      rental.update_column(:status, 4)

      car = Car.find(rental.car_id)
      owner_log = Log.create!(
        user_id: rental.user_id,
        action: 4,
        content: 'Canceled renting my '+car.make+' '+car.model+' starting '+helpers.smart_date(rental.start_time, true)+' due to no one renting it before the start time')
      owner_log.touch(time: rental.start_time)
    end

    rentals = Rental.where([
      '(renter_id = ? OR user_id = ?) AND ((status = ? AND start_time < ?) OR (status = ? AND end_time < ?))',
      @user.id, @user.id, 1, DateTime.current, 2, DateTime.current])
    rentals.each do |rental|
      if rental.end_time < DateTime.current
        rental.update_column(:status, 3)

        car = Car.find(rental.car_id)