app/views/cars/show.html.erb

SELECT "tags".* FROM "tags" INNER JOIN "taggings" ON "tags"."id" = "taggings"."tag_id" WHERE "taggings"."car_id" = ?  [["car_id", 2]]
---
              <h5>Tags:
                <% @car.tags.each do |tag_group| %>